{
  "entries": [
    {
      "id": "entry-1",
      "date": "LOG 078.34.5",
      "title": "Initial Landing on Zebes",
      "active": false,
      "content": [
        "Touchdown confirmed on planet Zebes. Atmosphere breathable but contains unknown particulates. Beginning preliminary survey of landing zone in Crateria region.",
        "Energy readings suggest significant activity below surface. Scans indicate multiple distinct biomes with unique environmental signatures."
      ],
      "cutscene": null
    },
    {
      "id": "entry-2",
      "date": "LOG 078.34.8",
      "title": "First Contact",
      "active": false,
      "content": [
        "Encountered hostile lifeforms in Brinstar region. Indigenous species demonstrate aggressive territorial behavior. Combat protocols engaged successfully.",
        "Discovered ruins of unknown origin with technology not matching Space Pirate database. Possible third party presence on planet."
      ],
      "cutscene": null
    },
    {
      "id": "entry-3",
      "date": "LOG 078.35.1",
      "title": "Anomalous Signal",
      "active": false,
      "content": [
        "Detected unusual energy signature from deep underground. Frequency pattern matches no known technology in Federation database.",
        "Signal appears to be a distress call but with corrupted data. Source appears to be mobile and changing location. Currently tracking trajectory."
      ],
      "cutscene": null
    },
    {
      "id": "entry-4",
      "date": "LOG 078.35.3",
      "title": "Space Pirate Activity",
      "active": false,
      "content": [
        "Confirmed presence of Space Pirate operations in Norfair region. High-temperature environment suggests they may be exploiting local geothermal energy sources.",
        "Intercepted transmissions indicate they are searching for something referred to as \"The Artifact.\" Cross-referencing with Federation databases yields no match."
      ],
      "cutscene": null
    },
    {
      "id": "entry-5",
      "date": "LOG 078.35.4",
      "title": "Current Objective",
      "active": true,
      "content": [
        "Primary mission directive updated: Investigate source of anomalous signal and locate \"The Artifact\" before Space Pirate forces.",
        "Environmental hazards in Norfair region require specialized equipment. Progress to deeper areas currently blocked."
      ],
      "cutscene": null
    },
    {
      "id": "entry-6",
      "date": "LOG 078.36.1",
      "title": "New Discovery",
      "active": false,
      "content": [
        "Analysis of artifact fragments suggests extraterrestrial origin.",
        "Energy signature matches no known Federation or Pirate technology.",
        "Further investigation required."
      ],
      "cutscene": "discovery_cutscene"
    }
  ]
}
